# FabricationServiceAbbreviation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricationServiceAbbreviation Property
ParameterTypeId Class See Also
---
"Fabrication Service Abbreviation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricationServiceAbbreviation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationServiceAbbreviation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricationServiceAbbreviation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace